---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopDistance
source: html/ca5a8e7e-e645-fdd4-16f1-092c8b88a002.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopDistance Property

"Top Attachment Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentTopDistance { get; }
```